from threading import Thread
from crawlLibTwitter import *


########################################################################################################################

                                ##      ##        ##        ######    ##      ##
                                ####  ####      ##  ##        ##      ##      ##
                                ##  ##  ##    ##      ##      ##      ####    ##
                                ##  ##  ##    ##      ##      ##      ##  ##  ##
                                ##      ##    ##########      ##      ##    ####
                                ##      ##    ##      ##      ##      ##      ##
                                ##      ##    ##      ##    ######    ##      ##

########################################################################################################################


keyword = '신천지'
channel = 'Twitter'
startDate = '2020-01-01'
endDate = '2020-02-28'

nUrl = 10000

TwitterLister = TwitterLister(nUrl, keyword, channel, startDate, endDate)
TwitterLister.getTwitterUrl()

